
--- 
title  : "Free Cabineo Connector "
category   : "Tooling technology"
headline   : " "
short_desc   : " When you purchase a MULTI V3 Cabineo, you will receive a voucher for 1,000 Cabineo connectors of your choice for free."
long_desc   : "The MULTI V3 Cabineo was specially developed for drilling pockets for the Cabineo connector system from Lamello. The pocket is inserted in one stroke, thus reducing the machining time on your CNC machine: three drills become one and you save time and money from the first use. Because you manufacture everything on your CNC machine, you optimize production processes and logistics.  "
img   : "/images/cabineo-verbinder.png"
series : "/benz/wood/woodmachinetechnologies/woodmotorspindles/"
link : "sl11khhskf63pn01"
---

--- 
title  : "Angle heads "
category   : "Tooling technology"
headline   : " "
short_desc   : " BENZ angle heads for the most diverse machining applications such as drilling, milling and sawing at CNC machining centers."
long_desc   : "Economically process wood and composites: We provide angle heads for drilling, milling, sawing and other special applications. BENZ units are available in a variety of performance classes, making them ideal for everything from light machining to high-performance continuous operation.  "
img   : "/images/holz-winkelkoefe.png"
series : "/benz/wood/woodmachinetechnologies/woodmotorspindles/"
link : "sl11khhskf63pn01"
---

--- 
title  : "Adjustable angle heads "
category   : "Tooling technology"
headline   : " "
short_desc   : "BENZ adjustable angle heads with manual or automatically adjustable angles for flexible machining. "
long_desc   : " BENZ swivel heads with manual or automatically adjustable A-axis angles for flexible workpiece machining. "
img   : "/images/holz-schwenkkoepfe.png"
series : "/benz/wood/woodmachinetechnologies/woodmotorspindles/"
link : "sl11khhskf63pn01"
---

--- 
title  : "Multi-spindle heads "
category   : "Tooling technology"
headline   : " "
short_desc   : " BENZ multi-spindle heads for the reduction of machining time."
long_desc   : "Multi-spindle heads help you save enormous amounts of time. They produce complex drilling patterns or multiple parallel grooves in a single machining step.  "
img   : "/images/holz-mehrspindelkoepfe.png"
series : "/benz/wood/woodmachinetechnologies/woodmotorspindles/"
link : "sl11khhskf63pn01"
---

--- 
title  : "Floating trimming units "
category   : "Tooling technology"
headline   : " "
short_desc   : " BENZ floating trimming units for compensation of plate thickness tolerances or setting precision."
long_desc   : " BENZ has developed multiple floating head units for gated drill, mill and saw machining. Plate thickness tolerances or setting inaccuracies are compensated by the unit automatically. The machining always takes place in a defined and constant distance to the floating surface. "
img   : "/images/holz-tastaggregate.png"
series : "/benz/wood/woodmachinetechnologies/woodmotorspindles/"
link : "sl11khhskf63pn01"
---

--- 
title  : "Sanding units "
category   : "Tooling technology"
headline   : " "
short_desc   : "BENZ sanding units, for the sanding of concave, convex and flat surfaces. "
long_desc   : "It's a situation you know. You run your hand over a piece of furniture and appreciate its shape under your fingertips. One surface feels rough, another feels fine and smooth. There's only one thing that can deliver this distinctive feeling: the perfect sanding pattern. BENZ sanding units make sure that your workpiece gets the exactly right surface, for every shape and surface.
                                        Your benefit from machine CNC sanding: no more need for time-consuming clamping for further processing or manual rework. Your production process is streamlined and your production costs are reduced as a result. "
img   : "/images/holz-schleifaggregate-v2.png"
series : "/benz/wood/woodmachinetechnologies/woodmotorspindles/"
link : "sl11khhskf63pn01"
---

--- 
title  : " Cutting units"
category   : "Tooling technology"
headline   : " "
short_desc   : "BENZ cutting units for the most varied of materials, such as cardboard, foamed plastic, inlays, carpet etc. "
long_desc   : "Where wood previously dominated, today you see materials like leather or textiles moving into the production process. Leather-covered seating, foamed-lined instrument cases or lampshades made of pieced-together veneer parts—the list of application examples is long. Despite this new mix of materials, nothing changes for you in production. Thanks to the BENZ SECO cutting unit, you do not need any special machines. Rather, you are able to cut these materials easily on your CNC machine—and without any splintering.  "
img   : "/images/holz-schneidaggregate.png"
series : "/benz/wood/woodmachinetechnologies/woodmotorspindles/"
link : "sl11khhskf63pn01"
---

--- 
title  : "Chiseling mortising units "
category   : "Tooling technology"
headline   : " "
short_desc   : "BENZ chiseling mortising units for making rectangular cutouts for many work pieces like stairs or windows. "
long_desc   : " Typical applications for chiseling processes are stake holes on steps for mounting a handrail or inserting fiche hinges in window processing. Whether hard or soft wood, CNC chiseling units help you achieve precise, square cutouts. "
img   : "/images/holz-stemmaggregate.png"
series : "/benz/wood/woodmachinetechnologies/woodmotorspindles/"
link : "sl11khhskf63pn01"
---

--- 
title  : " Tool holders"
category   : "Tooling technology"
headline   : " "
short_desc   : "BENZ tool holders for your CNC machine for drilling, milling and sawing. "
long_desc   : " BENZ tool holders for holding cutters, drills and saw blades for the processing of wood and composites at machining centers. "
img   : "/images/holz-werkzeughalter (1).png"
series : "/benz/wood/woodmachinetechnologies/woodmotorspindles/"
link : "sl11khhskf63pn01"
---

--- 
title  : "Chain units "
category   : "Tooling technology"
headline   : " "
short_desc   : " BENZ chain units for machining operations such as milling and sawing on CNC machining centres"
long_desc   : " Economically process wood and composites: We provide chain units for milling and sawing. "
img   : "/images/wood-cateno-kettenaggregate.png"
series : "/benz/wood/woodmachinetechnologies/woodmotorspindles/"
link : "sl11khhskf63pn01"
---
        