{
  "machining":{ 
  name : "Tooling technology for machining centers",
  category : "Metal",
  headline :" ",
  short_desc :"Angle heads, high-speed spindles, broaching units and multi-spindle heads that offer the perfect fit for your machining center. ",
  long_desc :"Tooling technology for your machining center: Angle heads, high-speed spindles, push-type aggregates and multi-spindle heads.  ",
  img :"/images/machinecenter.png",
  features : [" ", " ", " "],
  "link":"machining-tools"
  
  },
  "turning":{ 
  name : "Tooling technology for turning centers",
  category : "Metal",
  headline :" ",
  short_desc :"Live tools, broaching units and static holders for your lathe  ",
  long_desc :" BENZ offers an extensive variety of sizes in the area of powered tools and static holders. In addition to standard shapes, such as axial and radial, BENZ also offers multi-spindles, swivel heads and shapers. We can draft and manufacture individualized solutions to meet your specific needs. ",
  img :"/images/turningcenter.png",
  features : [" ", " ", " "],
  "link":"turning-tools"
  },
  "technology":{ 
  name : "Machine tooling technology",
  category : "Metal",
  headline :" ",
  short_desc :"We accompany your machine tooling technology project from brainstorming to inspection of the final machine, always to your expectations.  ",
  long_desc :"Forward-looking machine concepts are rarely based on set standards. They are born from innovative ideas. The challenge for system partners is in transferring these ideas to the final machine design.This is exactly what BENZ provides: We deliver ingenious solutions and innovative refinements at a high technical level, both for components as well as individualized, complex systems. Describe your requirements to us and we will find the right solutions. And that goes far beyond just engineering. As your partner, we accompany and support you throughout the entire process, from brainstorming to inspection of the final machine. Give us a challenge! Constant improvement is essential for delivering maximum performance and value. And only those who truly master the technology can develop solutions that fit your exact needs and enable you to create value for your customers. Our know-how helps you establish a unique competitive advantage. For the long-term. In any industry. Worldwide.  ",

  img :"/images/machine-tooling.png",
  features : [" ", " ", " "],
  "link":"machine-tooling-technology"
  }
}